БухЭксп/Catalogs/CW_ЭлектронныеПисьмаДляОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ЭлектронныеПисьмаДляОбработки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КритерийОтбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_КритерииОтбораЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Comment>Идентификатор письма</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыОбработкиПочтовыхСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Тексты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТекста</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кодировка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДД</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расширение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MIME</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ЭлектронныеПисьмаДляОбработки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СохранитьВложение(Команда)
	
	СтрокаТЧ = Объект.Вложения.НайтиПоИдентификатору(Элементы.Вложения.ТекущаяСтрока);
	
	СтруктураОтвета = _ПолучитьВложениеПисьма(СтрокаТЧ.НомерСтроки);
	
	Если СтруктураОтвета.Код = 0 Тогда
		
		// --- получаем файл
		ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
		ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
		
		НачатьПолучениеФайлаССервера(СтруктураОтвета.АдресФайла,СтрокаТЧ.ИмяФайла,ПараметрыДиалогаПолученияФайлов);
		
		
	Иначе
		
		Сообщить(СтруктураОтвета.ОписаниеОшибки);
		
	КонецЕсли; 

	
КонецПроцедуры

&НаСервере
Функция _ПолучитьВложениеПисьма(Знач СтрокаТЧ)
	// --- 
	
	Ответ = _УФКС.Ответ(0);
	
	Попытка
		
		Справочник = РеквизитФормыВЗначение("Объект");
		
		СтрокаТЧ = Справочник.Вложения[СтрокаТЧ-1];
		Ответ.Вставить("АдресФайла",ПоместитьВоВременноеХранилище(СтрокаТЧ.Вложение.Получить(),УникальныйИдентификатор));

		ЗначениеВРеквизитФормы(Справочник,"Объект");
		
		Возврат(Ответ);
		
	Исключение
		
		Ответ.Код = 1;
		Ответ.ОписаниеОшибки = ОписаниеОшибки();
		
		Возврат(Ответ);
		
	КонецПопытки; 
	
	// --- 
КонецФункции
 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура СохранитьТекст(Команда)
	
	СтрокаТЧ = Объект.Тексты.НайтиПоИдентификатору(Элементы.Тексты.ТекущаяСтрока);
	
	СтруктураОтвета = _ПолучитьТекстПисьма(СтрокаТЧ.НомерСтроки);
	
	Если СтруктураОтвета.Код = 0 Тогда
		
		// --- получаем файл
		ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
		ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
		
		НачатьПолучениеФайлаССервера(СтруктураОтвета.АдресФайла,"Текст"+СтрокаТЧ.НомерСтроки+".txt",ПараметрыДиалогаПолученияФайлов);
		
		
	Иначе
		
		Сообщить(СтруктураОтвета.ОписаниеОшибки);
		
	КонецЕсли; 

	
КонецПроцедуры

&НаСервере
Функция _ПолучитьТекстПисьма(Знач СтрокаТЧ)
	// --- 
	
	Ответ = _УФКС.Ответ(0);
	
	Попытка
		
		Справочник = РеквизитФормыВЗначение("Объект");
		
		СтрокаТЧ = Справочник.Тексты[СтрокаТЧ-1];
		Ответ.Вставить("АдресФайла",ПоместитьВоВременноеХранилище(СтрокаТЧ.ДД.Получить(),УникальныйИдентификатор));

		ЗначениеВРеквизитФормы(Справочник,"Объект");
		
		Возврат(Ответ);
		
	Исключение
		
		Ответ.Код = 1;
		Ответ.ОписаниеОшибки = ОписаниеОшибки();
		
		Возврат(Ответ);
		
	КонецПопытки; 
		
	// --- 
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя, Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти
